In [3]:
import pandas as pd
#Creating Pandas DataFrame
data = {
'OrderID': [101, 102, 103, 104, 105],
'Product': ['Widget', 'Gadget', 'Widget', 'Doodad', 'Widget'],
'Quantity': [10, 5, 0, 7, 15],
'Status': ['Shipped', 'Canceled', 'Canceled', 'Shipped', 'Shipped']
}
df = pd.DataFrame(data)

csv_file_path = 'output.csv'         #Specifying the file path to save the CSV file

df.to_csv(csv_file_path, index=False) #Writing the DataFrame to a CSV file, this will create a new file in the current folder
print(f'Data has been written to {csv_file_path}')

Data has been written to output.csv

In [4]:
data_df=pd.read_csv('output.csv')
data_df

   OrderID Product  Quantity    Status
0      101  Widget        10   Shipped
1      102  Gadget         5  Canceled
2      103  Widget         0  Canceled
3      104  Doodad         7   Shipped
4      105  Widget        15   Shipped

In [5]:
data_df=pd.read_csv('output.csv',nrows=2,usecols=["Product","Status"])
data_df

  Product    Status
0  Widget   Shipped
1  Gadget  Canceled

In [6]:
data_df=pd.read_csv('output.csv',nrows=3,usecols=[0,2,3])
data_df

   OrderID  Quantity    Status
0      101        10   Shipped
1      102         5  Canceled
2      103         0  Canceled

In [7]:
data_df=pd.read_csv('output.csv',skiprows=[0,2])
data_df

   101  Widget  10   Shipped
0  103  Widget   0  Canceled
1  104  Doodad   7   Shipped
2  105  Widget  15   Shipped

In [8]:
data_df=pd.read_csv('output.csv',index_col="OrderID")
data_df

        Product  Quantity    Status
OrderID
101      Widget        10   Shipped
102      Gadget         5  Canceled
103      Widget         0  Canceled
104      Doodad         7   Shipped
105      Widget        15   Shipped

In [9]:
data_df=pd.read_csv('output.csv',header=2)
data_df

   102  Gadget   5  Canceled
0  103  Widget   0  Canceled
1  104  Doodad   7   Shipped
2  105  Widget  15   Shipped

In [10]:
data_df=pd.read_csv('output.csv',names=["col1","col2","col3","col4"])
data_df

      col1     col2      col3      col4
0  OrderID  Product  Quantity    Status
1      101   Widget        10   Shipped
2      102   Gadget         5  Canceled
3      103   Widget         0  Canceled
4      104   Doodad         7   Shipped
5      105   Widget        15   Shipped

In [11]:
df=pd.read_csv('output.csv')
df.index        #variable inside dataframe

RangeIndex(start=0, stop=5, step=1)

In [12]:
df.index.array

<NumpyExtensionArray>
[np.int64(0), np.int64(1), np.int64(2), np.int64(3), np.int64(4)]
Length: 5, dtype: int64

In [13]:
df.columns

Index(['OrderID', 'Product', 'Quantity', 'Status'], dtype='object')

In [14]:
df.describe()

          OrderID  Quantity
count    5.000000   5.00000
mean   103.000000   7.40000
std      1.581139   5.59464
min    101.000000   0.00000
25%    102.000000   5.00000
50%    103.000000   7.00000
75%    104.000000  10.00000
max    105.000000  15.00000

In [15]:
df.head()         #by default gives 5 rows

   OrderID Product  Quantity    Status
0      101  Widget        10   Shipped
1      102  Gadget         5  Canceled
2      103  Widget         0  Canceled
3      104  Doodad         7   Shipped
4      105  Widget        15   Shipped

In [16]:
df.head(3)

   OrderID Product  Quantity    Status
0      101  Widget        10   Shipped
1      102  Gadget         5  Canceled
2      103  Widget         0  Canceled

In [17]:
df.tail()         #gives 5 rows by default from bottom

   OrderID Product  Quantity    Status
0      101  Widget        10   Shipped
1      102  Gadget         5  Canceled
2      103  Widget         0  Canceled
3      104  Doodad         7   Shipped
4      105  Widget        15   Shipped

In [18]:
df.tail(2)

   OrderID Product  Quantity   Status
3      104  Doodad         7  Shipped
4      105  Widget        15  Shipped

In [19]:
df[1:4]

   OrderID Product  Quantity    Status
1      102  Gadget         5  Canceled
2      103  Widget         0  Canceled
3      104  Doodad         7   Shipped

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   OrderID   5 non-null      int64
 1   Product   5 non-null      object
 2   Quantity  5 non-null      int64
 3   Status    5 non-null      object
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [21]:
df.info(verbose=False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Columns: 4 entries, OrderID to Status
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [22]:
df.count()

OrderID     5
Product     5
Quantity    5
Status      5
dtype: int64

In [23]:
import numpy as np
data = {
    'ID': [1, 2, 3, 4, 5, 6, 7, 8, 9],
    'Name': ['John Doe', 'Jane Smith', 'John Doe', 'Mike Brown', 'Sarah Lee', 'Jane Smith', np.nan, np.nan, 'Mike Brown'],
    'Age': [28, 34, 28, 45, np.nan, 34, np.nan, 29, np.nan],
    'City': ['New York', 'Los Angeles', 'New York', 'Chicago', np.nan, 'Los Angeles', np.nan, 'San Francisco', 'Chicago'],
    'Email': ['johndoe@example.com', 'janesmith@example.com', 'johndoe@example.com', 'mikebrown@example.com', 'sarahlee@example.com', 'janesmith@example.com', np.nan, np.nan, 'mikebrown@example.com']
}
df = pd.DataFrame(data)

csv_file_path = 'student.csv'         #Specifying the file path to save the CSV file

df.to_csv(csv_file_path, index=False) #Writing the DataFrame to a CSV file, this will create a new file in the current folder
print(f'Data has been written to {csv_file_path}')

Data has been written to student.csv

In [24]:
data_df=pd.read_csv('student.csv')
data_df

   ID        Name   Age           City                  Email
0   1    John Doe  28.0       New York    johndoe@example.com
1   2  Jane Smith  34.0    Los Angeles  janesmith@example.com
2   3    John Doe  28.0       New York    johndoe@example.com
3   4  Mike Brown  45.0        Chicago  mikebrown@example.com
4   5   Sarah Lee   NaN            NaN   sarahlee@example.com
5   6  Jane Smith  34.0    Los Angeles  janesmith@example.com
6   7         NaN   NaN            NaN                    NaN
7   8         NaN  29.0  San Francisco                    NaN
8   9  Mike Brown   NaN        Chicago  mikebrown@example.com

In [25]:
df.dropna(inplace=True)
print(df)

   ID        Name   Age         City                  Email
0   1    John Doe  28.0     New York    johndoe@example.com
1   2  Jane Smith  34.0  Los Angeles  janesmith@example.com
2   3    John Doe  28.0     New York    johndoe@example.com
3   4  Mike Brown  45.0      Chicago  mikebrown@example.com
5   6  Jane Smith  34.0  Los Angeles  janesmith@example.com

In [26]:
df.duplicated()

0    False
1    False
2    False
3    False
5    False
dtype: bool

In [38]:
import pandas as pd

# Create a DataFrame with 5 columns
data = {
    'ID': [1, 2, 3, 4, 5, 6, 7, 8, 9],
    'Name': ['John Doe', 'Jane Smith', 'John Doe', 'Mike Brown', 'Sarah Lee', 'Jane Smith', "NULL", "NULL", 'Mike Brown'],
    'Age': [28, 34, 28, 45, "Null", 34, 32, 29, 30],
    'City': ['New York', 'Los Angeles', 'New York', 'Chicago', "NULL", 'Los Angeles', "Chicago", 'San Francisco', 'Chicago'],
    'Email': ['johndoe@example.com', 'janesmith@example.com', 'johndoe@example.com', 'mikebrown@example.com', 'sarahlee@example.com', 'janesmith@example.com', "NULL", "NULL", 'mikebrown@example.com']
}

# Convert dictionary to DataFrame
df = pd.DataFrame(data)

# Print the DataFrame before removing duplicates
print("DataFrame before removing duplicates:")
print(df)

# Print unique values in each column
print("\nUnique values in each column:")
for column in df.columns:
    print(f"\n{column}:")
    print(df[column].unique())

# Strip leading and trailing spaces
df = df.apply(lambda x: x.str.strip() if x.dtype == "object" else x)

# Identify duplicate rows, including all occurrences
duplicate_rows = df.duplicated(keep=False)

print("\nBefore Removing Number of duplicate rows:", duplicate_rows.sum())
print(df[duplicate_rows])

# Remove duplicate rows
df.drop_duplicates(inplace=True)

# Recalculate duplicate rows after removal
duplicate_rows_after = df.duplicated(keep=False)

print("\nAfter Removing Number of duplicate rows:", duplicate_rows_after.sum())
print(df[duplicate_rows_after])

# Save the DataFrame to a CSV file
df.to_csv('after_drop.csv', index=False)

DataFrame before removing duplicates:
   ID        Name   Age           City                  Email
0   1    John Doe    28       New York    johndoe@example.com
1   2  Jane Smith    34    Los Angeles  janesmith@example.com
2   3    John Doe    28       New York    johndoe@example.com
3   4  Mike Brown    45        Chicago  mikebrown@example.com
4   5   Sarah Lee  Null           NULL   sarahlee@example.com
5   6  Jane Smith    34    Los Angeles  janesmith@example.com
6   7        NULL    32        Chicago                   NULL
7   8        NULL    29  San Francisco                   NULL
8   9  Mike Brown    30        Chicago  mikebrown@example.com

Unique values in each column:

ID:
[1 2 3 4 5 6 7 8 9]

Name:
['John Doe' 'Jane Smith' 'Mike Brown' 'Sarah Lee' 'NULL']

Age:
[28 34 45 'Null' 32 29 30]

City:
['New York' 'Los Angeles' 'Chicago' 'NULL' 'San Francisco']

Email:
['johndoe@example.com' 'janesmith@example.com' 'mikebrown@example.com'
 'sarahlee@example.com' 'NULL']

Before Removing Number of duplicate rows: 0
Empty DataFrame
Columns: [ID, Name, Age, City, Email]
Index: []

After Removing Number of duplicate rows: 0
Empty DataFrame
Columns: [ID, Name, Age, City, Email]
Index: []